# DAIR ASSIGNMENT V

Name:     Sanidhya \
SID:    22106024 \
Branch: Computer Science Engineering (Data Science)

In [21]:
import sqlite3

In [22]:
# Create a database named BookHaven.
con = sqlite3.connect("Book_haven.db")

In [23]:
cursor=con.cursor()
cursor.execute('''DROP TABLE IF EXISTS Books''')
cursor.execute('''DROP TABLE IF EXISTS Authors''')
cursor.execute('''DROP TABLE IF EXISTS Customers''')
cursor.execute('''DROP TABLE IF EXISTS Sales''')

In [24]:
#Books: book_id, title, author_id, price, quantity
cursor.execute('''CREATE TABLE Books (
book_id INTEGER PRIMARY KEY,
title TEXT,
author_id INTEGER,
price REAL,
quantity INTEGER,
FOREIGN KEY (author_id) REFERENCES Authors(author_id)
)''')

In [25]:
# Authors: author_id, author_name, country
cursor.execute('''CREATE TABLE Authors (
author_id INTEGER PRIMARY KEY,
author_name TEXT,
country TEXT              
)''')

In [26]:
# Customers: customer_id, customer_name, email, phone
cursor.execute('''CREATE TABLE Customers (
customer_id INTEGER PRIMARY KEY,
customer_name TEXT,
email TEXT,
phone INTEGER              
)''')

In [27]:
#Sales: sale_id, customer_id, book_id, quantity_sold, total_price, sale_date
cursor.execute('''CREATE TABLE Sales (
sale_id INTEGER PRIMARY KEY,
total_price INTEGER,
customer_id INTEGER,
quantity_sold INTEGER,
book_id INTEGER,
sale_date DATE,
FOREIGN KEY (customer_id) REFERENCES Customers(customer_id),
FOREIGN KEY (book_id) REFERENCES Books(book_id)                            
)''')

In [28]:
cursor.execute('''INSERT INTO Books (book_id, title, author_id, price, quantity) VALUES 
    (111,'Harry Potter and the Philosophers Stone', 1, 15.99, 100),
    (112,'The Shining', 2, 12.50, 75),
    (113,'Pride and Prejudice', 3, 10.99, 120),
    (114,'To Kill a Mockingbird', 4, 11.75, 90),
    (115,'1984', 5, 9.99, 110)''')

In [29]:
cursor.execute('''INSERT INTO Authors (author_id,author_name, country) VALUES
    (011,'J.K. Rowling', 'United Kingdom'),
    (012,'Stephen King', 'United States'),
    (013,'Jane Austen', 'United Kingdom'),
    (014,'Harper Lee', 'United States'),
    (015,'George Orwell', 'United Kingdom')''')

In [30]:
cursor.execute('''INSERT INTO Customers (customer_name, email, phone) VALUES
    ('John Doe', 'john@example.com', '123-456-7890'),
    ('Jane Smith', 'jane@example.com', '987-654-3210'),
    ('Alice Johnson', 'alice@example.com', '456-789-0123'),
    ('Bob Brown', 'bob@example.com', '789-012-3456'),
    ('Charlie Davis', 'charlie@example.com', '321-654-9870')''')

In [31]:
cursor.execute('''INSERT INTO Sales (sale_id, customer_id, book_id, quantity_sold, total_price, sale_date) VALUES
    (1, 1, 1, 2, 31.98, '2024-02-20'),
    (2, 2, 2, 1, 12.50, '2024-02-19'),
    (3, 3, 3, 3, 32.97, '2024-02-18'),
    (4, 4, 4, 1, 11.75, '2024-02-17'),
    (5, 5, 5, 2, 19.98, '2024-02-16')''')

In [32]:
def execute_query(query):
    cursor.execute(query)
    rows = cursor.fetchall()
    for row in rows:
        print(row)

In [33]:
# a. Retrieve the details of all books
query_a = "SELECT * FROM Books"
print("Details of all books:")
execute_query(query_a)

Details of all books:
(111, 'Harry Potter and the Philosophers Stone', 1, 15.99, 100)
(112, 'The Shining', 2, 12.5, 75)
(113, 'Pride and Prejudice', 3, 10.99, 120)
(114, 'To Kill a Mockingbird', 4, 11.75, 90)
(115, '1984', 5, 9.99, 110)

In [34]:
# b. Retrieve the details of all customers.
query_b="SELECT * FROM Customers"
print("Details of all Customer:")
execute_query(query_b)

Details of all Customer:
(1, 'John Doe', 'john@example.com', '123-456-7890')
(2, 'Jane Smith', 'jane@example.com', '987-654-3210')
(3, 'Alice Johnson', 'alice@example.com', '456-789-0123')
(4, 'Bob Brown', 'bob@example.com', '789-012-3456')
(5, 'Charlie Davis', 'charlie@example.com', '321-654-9870')

In [35]:
# c. Retrieve the details of all sales transactions.
query_c="SELECT * FROM Sales"
print("Detail of All sales transactions")
execute_query(query_c)

Detail of All sales transactions
(1, 31.98, 1, 2, 1, '2024-02-20')
(2, 12.5, 2, 1, 2, '2024-02-19')
(3, 32.97, 3, 3, 3, '2024-02-18')
(4, 11.75, 4, 1, 4, '2024-02-17')
(5, 19.98, 5, 2, 5, '2024-02-16')

In [1]:
# d. Retrieve the total sales amount for each book.
query_d="SELECT Books.title, SUM(Sales.total_price) AS total_sales_amount FROM Books JOIN Sales ON Books.book_id = Sales.book_id GROUP BY Books.title"
print("\nTotal sales amount for each book:")
execute_query(query_d)

Total sales amount for each book:

NameError: name 'execute_query' is not defined

In [37]:
# e. Retrieve the total number of books sold.
query_e = "SELECT SUM(quantity_sold) FROM Sales"
print("\nTotal number of books sold:")
execute_query(query_e)

Total number of books sold:
(9,)

In [38]:
# f. Retrieve the details of books authored by a specific author
query_f = "SELECT * FROM Books WHERE author_id = 1"  # Assuming we are retrieving books by Author1
print("\nDetails of books authored by a specific author:")
execute_query(query_f)

Details of books authored by a specific author:
(111, 'Harry Potter and the Philosophers Stone', 1, 15.99, 100)

In [39]:
# g. Retrieve the details of sales transactions made by a specific customer
query_g = "SELECT * FROM Sales WHERE customer_id = 1"  # Assuming we are retrieving sales made by Customer1
print("\nDetails of sales transactions made by a specific customer:")
execute_query(query_g)

Details of sales transactions made by a specific customer:
(1, 31.98, 1, 2, 1, '2024-02-20')

In [40]:
# Close the connection
con.close()